Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh99-v2.tmx
Source language: bo
Languages: en

source: མཽད་གལ་གྱི་བུ་དེའི་ཚེ་དེའི་དུས་ན། བྲམ་ཟེ་གཞོན་ནུ་ཤིན་ཏུ་བརྟགས་སྤྱོད་ཅེས་བྱ་བ་ཤིང་སཱ་ལ་ཆེན་པོ་ལྟ་བུར་གྱུར་པ་དེ་གཞན་ཡིན་པར་སེམས་ན་ཁྱོད་ཀྱིས་དེ་ལྟར་མི་བལྟ་སྟེ།
en: Maudgalyāyana, in case you may think that at that time the brahmin Utterly Scrutinized Conduct, who was like a great sal tree, was anyone else, do not think so.

source: ང་དེའི་ཚེ་དེའི་དུས་ན་བྲམ་ཟེ་ཤིན་ཏུ་བརྟགས་སྤྱོད་ཅེས་བྱ་བ་ཤིང་སཱ་ལ་ཆེན་པོ་ལྟ་བུར་གྱུར་ཏོ། །
en: In those days the brahmin Utterly Scrutinized Conduct, who was like a great sal tree, was me.

source: ང་ཤིན་ཏུ་བརྟགས་པར་སྤྱོད་པ་དག་ལ་གནས་པས་མྱུར་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ཏེ། རྒྱལ་རིགས་ཤིང་སཱ་ལ་ཆེན་པོ་ལྟ་བུ་དང་། ཁྱིམ་བདག་ཤིང་སཱ་ལ་ཆེན་པོ་ལྟ་བུ་དང་། རྒྱལ་པོ་དང་། བློན་པོ་དང་། བློན་པོའི་བུ་དག་གིས་ཚུལ་ནི་དེ་དག་ཡིན་ནོ། །
en: By closely scrutinizing my conduct, I soon fully awakened to unexcelled and perfect buddhahood. And in the same way, so have people of the warrior caste that are like great sal trees, householders that are like great sal trees, as well as kings, ministers, and their children.

source: མཽད་གལ་གྱི་བུ་ཚུལ་དེས་སྤྱོད་པ་དེ་ནི་མྱུར་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱའོ། །
en: Maudgalyāyana, practicing in a similar manner, they have soon fully awakened to unexcelled and perfect buddhahood.

source: མཽད་གལ་གྱི་བུ་དེ་ལ་ངས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་འདི་ཡོངས་སུ་ཚོལ་བ་ན་དཀའ་བ་རྣམ་པ་མང་པོ་དུ་མ་དག་བྱས་ཤིང་གཏང་བར་དཀའ་བ་དག་ཀྱང་བཏང་སྟེ
en: “Maudgalyāyana, in pursuit of unexcelled and perfect awakening, I have undergone a number of trials and deprivations.

source: མཽད་གལ་གྱི་བུ་སྔོན་བྱུང་བ་འདས་པའི་དུས་འཁོར་བ་དཔག་ཏུ་མེད་པ་དེའི་ཕ་རོལ་གྱི་ཡང་ཆེས་ཕ་རོལ་ན། ཤར་ཕྱོགས་ཀྱི་ཕྱོགས་ན་འཇིག་རྟེན་གྱི་ཁམས་མི་འགུལ་བར་བྱས་པ་ཞེས་བྱ་བ་བྱུང་སྟེ།
en: Long ago in limitless cyclic existence, Maudgalyāyana, in the distant past there was in the east a world known as Unshakeable.

source: དེ་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་དྲི་མེད་སྤྱན་ཏོག་གི་རྒྱལ་པོ་ཞེས་བྱ་བ་ནས། སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཀྱི་བར་འཇིག་རྟེན་དུ་བྱུང་སྟེ།
en: In that world there appeared a thus-gone, worthy, perfect buddha named King Apex of Flawless Vision; he was learned and venerable, a blissful one, a knower of the world, a steersman who guided beings, unexcelled, a teacher of gods and humans, a buddha, a blessed one.

source: མཽད་གལ་གྱི་བུ་དེ་བཞིན་གཤེགས་པ་དྲི་མེད་སྤྱན་ཏོག་གི་རྒྱལ་པོ་དེའི་སངས་རྒྱས་ཀྱི་ཞིང་སྟོང་གསུམ་གྱི་འཇིག་རྟེན་གྱི་ཁམས་བརྗོད་དུ་མེད་པ་དག་བྱུང་ངོ་། །
en: Maudgalyāyana, the buddha realm of the thus-gone called King Apex of Flawless Vision was an indescribably vast trichiliocosm.

source: དེ་བཞིན་གཤེགས་པ་དྲི་མེད་སྤྱན་ཏོག་གི་རྒྱལ་པོ་དེའི་ཉན་ཐོས་ཀྱི་དགེ་འདུན་བརྗོད་དུ་མེད་པ་ཁྲག་ཁྲིག་དག་བྱུང་ངོ་། །
en: The thus-gone King Apex of Flawless Vision had an inexpressibly large community of one hundred billion hearers.

source: དེ་བཞིན་གཤེགས་པ་དྲི་མེད་སྤྱན་ཏོག་གི་རྒྱལ་པོ་དེའི་རིམ་གྲོ་པ་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེང་གེའི་བློ་གྲོས་ཞེས་བྱ་བ་བྱུང་སྟེ།
en: The chief attendant of the thus-gone King Apex of Flawless Vision was named Siṃhamati.

source: དེ་དེ་བཞིན་གཤེགས་པ་དྲི་མེད་སྤྱན་ཏོག་དེའི་རིམ་གྲོ་བ་ལོ་བྱེ་བ་ཁྲག་ཁྲིག་ཕྲག་བདུན་ཅུ་རྩ་དྲུག་ཏུ་བྱས་ཤིང་ཐུགས་དང་འཐུན་ཏེ།
en: He had been the chief attendant to the thus-gone King Apex of Flawless Vision for seventy-six quintillion years, and for that long had obeyed his every wish.

source: ཐུགས་དང་མི་འཐུན་པ་མ་ཡིན་པ་ལ་བཤད་པ་ཡང་འཛིན་ཅིང་རང་གི་དོན་ཀྱང་མི་གཏོང་ངོ་། །
en: He even came to be known as ‘the one who never disobeyed,’ and never did anything toward his own ambitions.

source: དེ་དེ་བཞིན་གཤེགས་པ་དྲི་མེད་སྤྱན་ཏོག་གི་རྒྱལ་པོ་དེ་ལ་ལོ་བྱེ་བ་ཁྲག་ཁྲིག་ཕྲག་བདུན་ཅུ་རྩ་དྲུག་ཏུ་ད་ལྟར་བྱུང་བ་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པའི་ཞུ་བ་ཞུས་སོ། །
en: “Over the course of those seventy-six quintillion years, he requested the thus-gone King Apex of Flawless Vision to explain the knowledge of the path that leads to cessation as related to knowledge of the present.

source: བཅོམ་ལྡན་འདས་ལེགས་སོ། །
en: The Blessed One agreed, and so he said, ‘

source: ད་ལྟར་བྱུང་བ་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་བདག་ལ་བཤད་དུ་གསོལ།
en: Please teach me the knowledge of the path that leads to cessation as related to knowledge of the present.’

source: གང་བདག་གིས་ད་ལྟར་བྱུང་བ་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་ཐོས་ནས་བཤད་པར་བགྱིའོ། །
en: ‘What I have myself heard about knowledge of the path leading to cessation as related to knowledge of the present, I will explain.’

source: དེ་བཞིན་གཤེགས་པ་དྲི་མེད་སྤྱན་ཏོག་གི་རྒྱལ་པོ་དེས། བཟའ་བ་དང་། བཏུང་བ་དང་། བཅའ་བ་དང་། གཟིམས་པ་མ་གཏོགས་པར་ལོ་བྱེ་བ་ཁྲག་ཁྲིག་ཕྲག་བདུན་ཅུ་རྩ་དྲུག་ཏུ་ད་ལྟར་བྱུང་བའི་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་བསྟན་ཏེ
en: “And so, aside from times they were eating, drinking, and sleeping, for seventy-six quintillion years the thus-gone King Apex of Flawless Vision taught on knowledge of the path leading to cessation as related to knowledge of the present.

source: ད་ལྟར་བྱུང་བའི་གནས་ཤེས་པ་འདི་ལྟར་ཡོངས་སུ་ཤེས་པར་བྱ། །
en: ‘This is how to understand what is possible regarding the present.

source: ད་ལྟར་བྱུང་བ་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་འདི་ལྟར་ཡོངས་སུ་ཤེས་པར་བྱ།
en: This is how to understand knowledge of the origin as related to knowledge of the present.

source: ད་ལྟར་བྱུང་བ་ཤེས་པ་འགོག་པ་ཤེས་པ་འདི་ལྟར་ཡོངས་སུ་ཤེས་པར་བྱ།
en: This is how to understand knowledge of cessation as related to knowledge of the present.

source: དེ་བཞིན་དུ་སྦྱར་ཏེ་གནས་མ་ཡིན་པ་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་ཡོངས་སུ་ཤེས་པར་བྱ།
en: Similarly, this is how to understand knowledge of the origin as related to knowledge of what is impossible.

source: གནས་མ་ཡིན་པ་ཤེས་པ་འགོག་པ་ཤེས་པ། གནས་མ་ཡིན་པ་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་ཡོངས་སུ་ཤེས་པར་བྱ།
en: This is how to understand knowledge of cessation as related to knowledge of what is impossible, and how to understand the path leading to cessation as related to knowledge of what is impossible.

source: དེ་བཞིན་དུ་ད་ལྟར་བྱུང་བ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་ཤེས་པ་ཡོངས་སུ་ཤེས་པར་བྱ།
en: Furthermore, this is how to understand the present in relation to knowledge of omniscience.

source: ཐམས་ཅད་མཁྱེན་པ་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་ད་ལྟར་བྱུང་བ་ཐམས་ཅད་མཁྱེན་པ་ཤེས་པ་འགོག་པ་ཤེས་པ། ད་ལྟར་བྱུང་བ་ཐམས་ཅད་མཁྱེན་པ་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་རབ་ཏུ་ཤེས་པར་བྱའོ། །
en: This is how to understand knowledge of the origin in relation to knowledge of omniscience, and knowledge of cessation in relation to omniscience regarding the present. And this is how to understand knowledge of the path leading to cessation in relation to knowledge of omniscience regarding the present.’

source: མཽད་གལ་གྱི་བུ་དེ་ཇི་སྙམ་དུ་སེམས།
en: “What do you think, Maudgalyāyana?

source: དེའི་ཚེ་དེའི་དུས་ན། བྱང་ཆུབ་སེམས་དཔའ་སེང་གེའི་བློ་གྲོས་ཞེས་བྱ་བ་རིམ་གྲོ་པར་གྱུར་པ་དེ་གཞན་ཡིན་པར་སེམས་ན། ཁྱོད་ཀྱིས་དེ་ལྟར་མི་བལྟ་སྟེ།
en: Maudgalyāyana, in case you may think that at that time the bodhisattva and chief attendant named Siṃhamati was anyone else, do not think so.

source: ང་དེའི་ཚེ་དེའི་དུས་ན། སེང་གེའི་བློ་གྲོས་ཞེས་བྱ་བ་རིམ་གྲོ་པར་གྱུར་ཏོ། །
en: In those days the chief attendant Siṃhamati was me.

source: མཽད་གལ་གྱི་བུ་དེ་ལྟ་བས་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པར་འདོད་པས་ལེ་ལོ་མེད་པར་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱི་རིམ་གྲོ་པར་ཡོངས་སུ་སྤྱད་པར་བྱ་ཞིང་ལུས་དང་སྲོག་ལ་མི་བལྟ་བར་སློང་བ་ལ་ཡོངས་སུ་མི་གཏོང་བ་ཅི་ཡང་མེད་པར་བྱའོ། །
en: Therefore, Maudgalyāyana, those bodhisattva great beings who wish to fully awaken to unexcelled and perfect buddhahood should assiduously serve as attendants to the blessed buddhas, and at whatever cost to life and limb, not hesitate to give whatever anyone might ask of them.

source: མཽད་གལ་གྱི་བུ་ངས་མངོན་པར་ཤེས་ཏེ། འདས་པའི་དུས་ན་ད་ལྟར་བྱུང་བ་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པར་བྱ་བའི་དོན་དུ་རྒྱལ་སྲིད་ཡོངས་སུ་གཏང་བར་བྱ་སྟེ།
en: “Maudgalyāyana, I remember that I once gave up a kingdom in order to gain knowledge of the path leading to cessation in relation to the present.

source: མཽད་གལ་གྱི་བུ་སྔོན་བྱུང་བ་འདས་པའི་དུས་འཁོར་བ་དཔག་ཏུ་མེད་པ་དེའི་ཕ་རོལ་གྱི་ཡང་ཆེས་ཕ་རོལ་ན། རྒྱལ་པོ་ཚངས་པས་བྱིན་ཞེས་བྱ་བ་བདག་གི་བ་ཐམས་ཅད་ཡོངས་སུ་གཏོང་ཞིང་ལེགས་པར་གསུངས་པ་ཚོལ་བ་ཞིག་བྱུང་ངོ་། །
en: Long ago in the limitless cycle of existence, Maudgalyāyana, in the distant past there lived a king named Brahmadatta who gave up everything he owned and sought the sublime teachings.

source: དེ་སློངས་མོ་པ་གང་དང་གང་སློང་བ་དེ་དང་སྦེད་པ་མེད་པར་ཡོངས་སུ་གཏོང་ངོ་། །
en: Whatever any beggar asked him for, he gave without holding anything back.

source: མཽད་གལ་གྱི་བུ་དེ་ནས་རྒྱལ་པོ་ཚངས་པས་བྱིན་བཙུན་མོ་དམ་པ་དང་། བུ་ཐུ་བོ་གཞོན་ནུ་དང་ལྷན་ཅིག་ཏུ་བཀད་སར་སོང་ནས་
en: Once, Maudgalyāyana, King Brahmadatta went with Her Majesty the Queen and the crown prince to the dining hall.

source: འཁོད་པ་ལས། དེ་ནས་ཤ་ཟ་གཟུགས་མཆོག་ཏུ་མི་སྡུག་པ་ཞིག་འོངས་ནས
en: Once there, a hideous piśāca demon arrived.

source: རྒྱལ་པོ་དེ་འདུག་པའི་བཀད་སའི་བར་སྣང་ལ་སྐྱིལ་མོ་ཀྲུང་བཅས་ནས་འདི་སྐད་ཅེས་སྨྲས་སོ། །
en: It sat cross-legged in midair in the middle of the dining hall where the king was sitting, and spoke to him:

source: ས་བདག་ཆེན་པོ་ལེགས་པར་གསུངས་པ་ཚོལ་བ་རྒྱལ་བར་སྤྱོན་ཅིག །
en: ‘O great lord of the land who seeks the sublime teachings, may you be victorious!

source: བདག་གིས་སྔོན་གྱི་དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱིས་ལེགས་པར་བཤད་པ་དེ་ལས་ཐོས་པ་ཡོད་དེ་ གལ་ཏེ་ཁྱོད་དེ་དོན་དུ་གཉེར་ན་ཟུང་ཤིག །
en: I have an excellent instruction I heard from thus-gone ones in the past—if you are interested you may have it.’

source: དེ་ནས་རྒྱལ་པོ་ཚངས་པས་བྱིན་གྱིས་ཤ་ཟ་དེ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །
en: “King Brahmadatta then replied to the piśāca demon,

source: འབྱུང་པོ་ཆེན་པོ་ལེགས་པར་གསུངས་པ་འདོད་ཀྱིས་གང་ཁྱོད་འདོད་པ་དེ་ངས་རབ་ཏུ་སྦྱིན་ནོ། །
en: ‘O great ghost, I do want the teaching. Whatever you wish is my command!’

source: དེས་སྨྲས་པ།
en: “The demon answered,

source: ས་བདག་ཆེན་པོ་གང་རྒྱལ་པོ་ཁྱོད་ཀྱི་སྡུག་པ་གསུམ་པོ་བདག་ཉིད་དང་ཆུང་མ་དང་བུ་དེ་དག་བདག་ལ་བྱིན་ན་ལེགས་པར་གསུངས་པ་ཕྱིས་བཤད་དོ། །
en: ‘O great lord of the land, if you give me the three things most dear to you—you yourself, your wife, and your son—I will then give you this sublime teaching.’

source: དེས་སྨྲས་པ། འདི་དག་གིས་ཅི་ཞིག་བྱ།
en: “ ‘What will you do with us?’ asked the king.

source: བཟའ་བར་བྱ་སྟེ། ལེགས་པར་གསུངས་པ་ཡང་བཤད་དོ། །
en: “ ‘I will eat you, but I shall also give you a teaching.’

source: དེ་ནས་རྒྱལ་པོ་ཚངས་པས་བྱིན་གཡོན་ལོགས་ན་ཆུང་མ་དང་། གཡས་ལོགས་ན་བུ་འདུག་པ་བལྟས་པ་དང་། དེ་དག་གིས་སྨྲས་པ།
en: “King Brahmadatta then glanced to both sides, seeing his wife on his left and his dear son on his right. They told him,

source: རྒྱལ་པོ་ཆེན་པོ་མྱུར་དུ་བདག་ཅག་ཐོང་ལ་ལེགས་པར་གསུངས་པ་གང་གིས་འཁོར་བ་ལས་སྒྲོལ་བར་འགྱུར་བའི་སླད་དུ་ལེགས་པར་གསུངས་པ་ཡང་གསོན་ཅིག །
en: ‘Your Majesty, you should give us up immediately, and hear whatever teaching there is that has the capability of liberating from cyclic existence.’

source: མཽད་གལ་གྱི་བུ་དེ་ནས་ཤ་ཟས་དེའི་ལྷག་པའི་བསམ་པ་རིག་ནས་ལེགས་པར་གསུངས་པའི་ཚིགས་སུ་བཅད་དེ་སྨྲས་སོ། །
en: “Maudgalyāyana, the piśāca demon was aware of their noble intention, and so granted them a sublime teaching in verse:

source: བདག་གི་ཕྱིར་དང་གཞན་གྱི་ཕྱིར་དག་ཏུ། །བདེ་བ་འདོད་ན་སྡིག་པ་མི་བྱ་སྟེ། །
en: “ ‘If you seek happiness for yourself And others, do not do anything harmful.

source: བྱིས་པ་བདེ་འདོད་གང་ཞིག་སྡིག་བྱེད་ན། །དེ་ཡི་འབྲས་བུ་སོ་སོར་མྱོང་བར་འགྱུར། །
en: Fools who do harmful things seeking happiness Will face the consequence of each one.’

source: དེ་ནས་རྒྱལ་པོ་ཚངས་པས་བྱིན་འདི་སྙམ་དུ་གྱུར་ཏེ།
en: “Then King Brahmadatta thought to himself,

source: ཇི་ཙམ་དུ་ལེགས་པར་གསུངས་པའི་ཚིགས་སུ་བཅད་པ་འདི་ནི་ངོ་མཚར་ཆེ་སྟེ།
en: ‘What an amazing verse of sublime teaching!

source: ཚིགས་སུ་བཅད་པ་འདིའི་དོན་དུ་བདག་གི་ལུས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་ཀྱང་ཡོངས་སུ་གཏང་བར་བྱ་སྟེ།
en: I would sacrifice as many of my own bodies as there grains of sand in the Ganges for this verse.

source: དེ་དག་ཀྱང་ཡོངས་སུ་བཏང་ནས་ཚིགས་སུ་བཅད་པ་འདི་འདོད་པར་བྱའོ་སྙམ་སྟེ།
en: Having sacrificed that many bodies, one should seek out this verse.’

source: དེ་སྟན་ལས་ལངས་ནས་ལག་པ་གཡོན་པས་ཆུང་མ་དང་། ལག་པ་གཡས་པས་བུ་བཟུང་སྟེ། ཤ་ཟ་དེ་ལ་སྨྲས་པ།
en: Standing up, he took his wife with his left hand and his son with his right, and told the piśāca demon:

source: ཚིགས་བཅད་འདི་ཡིས་བདག་གི་དོན་ཆེན་བྱེད། །
en: “ ‘This verse is of immense benefit to me.

source: ཇི་ལྟར་དགའ་བར་ཁྱོད་ཀྱིས་སྤྱད་པར་གྱིས། །
en: Whatever pleases you, you shall enjoy it.’

source: མཽད་གལ་གྱི་བུ་དེ་ནས་ཤ་ཟ་དེ་ཚུལ་དེ་མི་སྣང་བར་བྱས་ནས་རང་གི་ཚུལ་ཡང་དག་པར་བསྟན་ནས།
en: “Maudgalyāyana, the form of the piśāca demon then vanished and its true form was revealed.

source: རྒྱལ་པོ་ཚངས་པས་བྱིན་དེ་ལ་ཚིགས་སུ་བཅད་དེ་སྨྲས་པ།
en: It then spoke in verse to King Brahmadatta:

source: སྦྱིན་ལ་དཔའ་བ་ལེགས་སོ་ལེགས། །
en: “ ‘I commend your courage in giving—

source: སེར་སྣའི་སྡིག་པ་བཅོམ་བྱས་ཤིང་། །གཏོང་བ་སོ་སོར་འཛིན་པ་ཁྱོད། །དེ་ནི་ཡིད་བཞིན་གྲུབ་གྱུར་ཅིག །
en: You have overcome the sin of stinginess. Your gifts are accepted; May your wishes be fulfilled.’

source: དེ་ནས་རྒྱལ་པོ་ཚངས་པས་བྱིན་གྱིས། འབྱུང་པོ་ཆེན་པོ་དེ་ལ་སྨྲས་པ།
en: “King Brahmadatta then asked the ghost,

source: གྲོགས་པོ་ཁྱོད་སུ་ཞིག །
en: ‘My friend, who exactly are you?’

source: གྲོགས་པོ་བདག་ནི་ལྷ་རྣམས་ཀྱི་དབང་པོ་བརྒྱ་བྱིན་ཡིན་ཏེ།
en: ‘Friend, I am Śakra, lord of the gods.

source: རྒྱལ་པོ་ཆེན་པོ་ཁྱོད་མཆོག་གང་དང་གང་འདོད་པའི་དེང་ལས་ལོང་།
en: Whatever is the foremost thing you desire, Your Majesty, please ask me.’

source: དེ་ནས་རྒྱལ་པོ་ཚངས་པས་བྱིན་གྱིས་འདི་སྐད་ཅེས་སྨྲས་སོ། །
en: “King Brahmadatta then said,

source: ལྷ་རྣམས་ཀྱི་དབང་པོ་གལ་ཏེ་མཆོག་སྩལ་བར་སྤྱོད་ན། གང་ལ་སྐྱེ་བ་མེད་པ་དང་། རྒ་བ་མེད་པ་དང་། ན་བ་མེད་པ་དང་། འཆི་བ་མེད་པ་དང་། མྱ་ངན་དང་། སྨྲེ་སྔགས་འདོན་པ་དང་། སྡུག་བསྔལ་བ་དང་། ཡིད་མི་བདེ་བ་དང་། འཁྲུགས་པ་མེད་པ་མཆོག་དེ་བདག་ལ་སྩོལ་ཅིག །
en: ‘O Lord of the Gods, if you will consent to bestowing the most supreme thing of all, please grant that supreme thing which is not born, does not age, does not become sick, does not die, does not feel pain, does not lament, does not suffer, does not experience unhappiness, and is never disturbed.’

source: དེས་དེ་ལ་སྨྲས་པ། རྒྱལ་པོ་ཆེན་པོ་བདག་འདི་ལ་དབང་མེད་དེ།
en: “ ‘Your Majesty,’ replied Śakra, ‘I do not possess such a thing.

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་ནི་མཆོག་འདི་ལ་མངའ་བརྙེས་སོ། །
en: However, the Blessed Buddha does possess such a perfect thing.

source: མཆོག་གཞན་གང་དང་གང་འདོད་པ་སློངས།
en: Please request some other supreme thing you desire.’

source: དེ་ནས་རྒྱལ་པོ་ཚངས་པས་བྱིན་གྱིས་ལྷ་རྣམས་ཀྱི་དབང་པོ་བརྒྱ་བྱིན་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །
en: “King Brahmadatta then addressed Śakra, lord of the gods:

source: དབང་ཕྱུག་པ་ཡང་དབང་མེད་པ་དག་བྱིས་པ་མཐོང་ངོ་ཅོག །
en: ‘You may be lord, but yet you are powerless—all I see is a fool.’

source: བརྒྱ་བྱིན་ཡི་ཆད་འདི་ལྟར་གླང་ཆེན་འདམ་སོང་ཉམས་པ་བཞིན། །
en: “Śakra became dejected, disgraced like an elephant who has sunk in the mud.

source: མཽད་གལ་གྱི་བུ་དེའི་ཚེ་དེའི་དུས་ན། རྒྱལ་པོ་ཚངས་པས་བྱིན་ཞེས་བྱ་བ་དེ་གཞན་ཡིན་པར་སེམས་ན་ཁྱོད་ཀྱིས་དེ་ལྟར་མི་བལྟ་སྟེ།
en: “Maudgalyāyana, in case you may think that at that time the one known as King Brahmadatta was anyone else, do not think so.

source: དེའི་ཚེ་དེའི་དུས་ན། རྒྱལ་པོ་ཚངས་པས་བྱིན་ཞེས་བྱ་བར་གྱུར་པ་དེར་ཡིན་ནོ། །
en: In those days King Brahmadatta was me.

source: མཽད་གལ་གྱི་བུ་དགེ་བའི་རྩ་བ་དེས་ང་ད་ལྟར་བྱུང་བ་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་བརྙེས་སོ། །
en: Maudgalyāyana, due to those roots of virtue I gained knowledge of the path leading to cessation as related to knowledge of the present.

source: མཽད་གལ་གྱི་བུ་དེ་ལྟ་བས་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འདོད་པ་དང་། ད་ལྟར་བྱུང་བ་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་ཐོབ་པར་འདོད་པས། བདག་གི་ཐམས་ཅད་ཡོངས་སུ་བཏང་བར་བསླབ་པར་བྱ། ལྟོས་པ་མེད་པར་སྦྱིན་པ་སྦྱིན་པར་བྱའོ།། །།
en: Thus, Maudgalyāyana, those bodhisattva great beings who want to fully awaken to unexcelled and perfect buddhahood, and who moreover wish to achieve knowledge of the path leading to cessation as related to knowledge of the present, should train in giving up all they own, and practice generosity without hesitation.”

source: མཽད་གལ་གྱི་བུ་ང་ལས་ཤེས་པར་བྱ་བའི་དོན་དུ་དགའ་བ་དཔག་ཏུ་མེད་པ་དག་སྤྱོད་ཅིང་། གཏང་བར་དཀའ་བ་དཔག་ཏུ་མེད་པ་དག་ཀྱང་བཏང་སྟེ
en: “Maudgalyāyana, I also underwent countless trials and deprivations in order to understand karma.

source: མཽད་གལ་གྱི་བུ་སྔོན་བྱུང་བ་འདས་པའི་དུས་འཁོར་བ་དཔག་ཏུ་མེད་པ་དེའི་ཕ་རོལ་གྱི་ཡང་ཆེས་ཕ་རོལ་ན། བྲམ་ཟེ་བྷ་ར་དྭ་ཛ་དང་རུས་གཅིག་པ་ཞེས་བྱ་བ་ཞིག་ཤིང་གཞན་ཞིག་གི་དྲུང་དུ་སོང་སྟེ།
en: Long ago in the limitless cycle of existence, Maudgalyāyana, in the distant past there was a brahmin named Descendant of Bharadvāja. Once he was traveling to visit someone.

source: འདུག་པ་ལས་དེའི་ཚེ་དུས་མ་ཡིན་པའི་སྤྲིན་ཆེན་པོ་ཞིག་བྱུང་ནས་དེ་ཉིད་དུ་ཆར་བབ་བོ། །
en: He was resting along the way when untimely storm clouds formed in the sky and it began to rain.

source: དེ་ནས་བྲམ་ཟེ་བྷ་ར་དྭ་ཛ་དང་རུས་གཅིག་པ་དེ་ཤིང་དྲུང་དེར་ཞག་བདུན་གྱི་བར་དུ་ཆར་བབ་སྟེདེ་ན་གནས་པ་ན་ཟས་མི་ཟ་བར་དེ་བཞིན་དུ་འདུག་གོ། །
en: The brahmin Descendant of Bharadvāja took shelter under a tree without anything to eat, while it continued to rain for seven days.

source: དེའི་ཚེ་ཤིང་དེའི་སྡོང་བུའི་གསེབ་ན། རི་བོང་ཡོན་ཏན་མཆོག་དང་ལྡན་པ་ཞིག་གནས་ཏེ།
en: In the hollow of the tree trunk there happened to live an extraordinary rabbit.

source: དེ་ཤིང་གསེབ་དེ་ནས་བྱུང་ནས། བྲམ་ཟེ་བྷ་ར་དྭ་ཛ་དང་རུས་གཅིག་པ་དེའི་རྐང་པ་ལ་ལྕེས་བལྡག་གོ། །དེ་ནས་བྲམ་ཟེ་བྷ་ར་དྭ་ཛ་དང་རུས་གཅིག་པས་རི་བོང་དེ་པང་བར་བླངས་ནས་ཞག་བདུན་གྱི་བར་དུ་འཛིན་ཅིང་ལག་པས་ཀྱང་དེའི་ལུས་ལ་ཡོངས་སུ་བྱུགས་སོ། །
en: It came out of its hollow and licked the foot of Descendant of Bharadvāja, who then took the rabbit onto his lap and held it there for the week he was there, petting it with his hand.

source: བྱམས་པའི་སེམས་ཀྱིས་ཡང་དག་པར་བལྟ་ཞིང་། ལུས་ཀྱི་ལས་ཀྱིས་ཡང་དག་པར་ཉུག་པར་བྱེད་དོ། །
en: He looked at the rabbit with affection in his heart and caressed its body.

source: བྱམས་པའི་ལུས་ཀྱི་ལས་ཀྱིས་ཡང་དག་པར་བྱུགས། བྱམས་པའི་ངག་གི་ལས་དང་། བྱམས་པའི་ཡིད་ཀྱི་ལས་ཀྱིས་ཀུན་ནས་བརྗོད་ཅིང་། དེའི་ཚེ་ཚིགས་སུ་བཅད་པ་འདི་དག་སྨྲས་སོ། །
en: With loving gestures he stroked it and with love in his voice and in his heart, he spoke to it, uttering for instance these verses:

source: རི་བོང་ཚལ་ཤིང་ནགས་ན་གནས་པ་ལེགས། །ཆོས་དང་ལྡན་ཞིང་ཆོས་དགའ་བླ་མ་བསྟེན། །
en: “ ‘Rabbit, it is well that you live here in the forest, To be righteous and follow a virtuous teacher.

source: གང་གིས་སྲིད་པ་ཚལ་ཤིང་འདི་རུ་གནས། །
en: But, how are you able to live here in this forest?

source: བདག་གིས་དྲིས་པ་དག་ནི་ལེགས་པར་སྨྲོས། །
en: Please grant a reply to my question.

source: ང་དང་ལྷན་ཅིག་འདུག་པའང་མི་འཇིགས་སམ། །
en: “ ‘Are you not afraid to be here with me?

source: གཞན་ཡང་བཀྲེས་དང་སྐོམ་པ་དག་མེད་དམ། །
en: Are you not also hungry and thirsty?

source: རྩྭ་འཇམ་དག་ལ་ཟ་བར་བྱེད་པ་ན། ཁྱོད་ཀྱི་ལུས་ནི་གང་གིས་ཚལ་ན་གནས། །
en: Do you eat grass, or otherwise How do you survive out here in the forest?’

source: མི་ཡི་བྲམ་ཟེ་བདག་ལས་གསན་པར་མཛོད། །
en: “ ‘O human brahmin, please hear what I say.

source: ནགས་ཁྲོད་འདི་ན་ཆོས་སྤྱོད་ཁྱོད་གཟིགས་ཤིག །
en: Look, O Dharma practitioner, around this forest—

source: བཏུང་བ་དག་དང་དེ་བཞིན་རྩྭ་མི་འཚལ། །
en: There is no grass or anything to drink,

source: དྲང་སྲོང་ལྟ་ཞིང་ལྷན་ཅིག་དགའ་བར་བགྱི། །
en: But to see a sage like you brings me delight.

source: ཆོས་ལྡན་མཐོང་ནས་ཚུལ་ཁྲིམས་བརྟུལ་ཞུགས་སྤྱད། །འཇིག་རྟེན་བདེ་དེར་དགའ་མགུ་ཐོབ་པར་བགྱི། །
en: “ ‘Seeing the virtuous, one practices disciplined conduct And becomes glad and joyful at such happiness in the world.

source: ཁྱོད་ཀྱིས་ལས་ཅི་བྱས་པས་མི་ཡུལ་དུ། །འོངས་ཤིང་གང་གིས་དུད་འགྲོའི་སྐྱེ་གནས་སོང་། །
en: Tell me, what deeds have you performed to enter the human realm? And what deeds lead to rebirth as an animal?

source: གང་ཞིག་ཐོས་ནས་མགུ་བར་འགྱུར་བ་དག །
en: “ ‘I would be overjoyed to hear about this.

source: དེ་ནི་བརྟགས་པའི་ཚིག་གིས་ང་ལ་སྨྲོས། །
en: Please choose your words well and tell me.’

source: སྨྲས་པ།
en: “The rabbit continued:

source: སྔོན་གྱི་སྲིད་པར་ཆོས་འཆད་ཉན་པར་བདག །ཞུགས་ནས་བདག་གིས་ཆོས་སྨྲ་དེ་གཙེས་ཏེ། །དེས་ན་དུད་འགྲོའི་འགྲོ་བར་བདག་སོང་ངོ་། །
en: “ ‘In a past life I listened to a Dharma teaching, But then hurt the Dharma teacher— Due to that I ended up as an animal.’

source: རིང་ཞིག་བདག་གིས་འདིར་འདུག་ང་ནི་འགྲོ། །
en: “ ‘I have been here a while, so I must go.

source: ཅུང་རྩན་བཟོད་མཛོད་སྐོམ་འཐུང་རྩྭ་ཟོ་ལ། །དུས་ལས་འདའ་བ་དག་ཏུ་ཁྱོད་མ་བྱེད། །
en: Be patient, little one—quench your thirst And eat some grass, you will not die here.’

source: བདག་ནི་ཆུད་གདོན་དུ་གཉེར་མ་ཡིན། །རྩྭ་ཡང་མི་འདོད་བཤད་པའང་མི་འདོད་ཀྱི། །
en: “ ‘I am not interested in water, I don’t want grass, and I don’t need speeches.

source: བདག་ལ་གཟིགས་ཤིང་མ་བཏང་མ་བཞུད་པར། །བྲམ་ཟེ་ཚལ་འདིའི་ནང་དུ་བཞུགས་པར་མཛོད། །
en: Brahmin, don’t forsake me or go away But look after me and stay here in the forest.’

source: ཅུང་རྩན་བཟའ་བའི་རྣམ་པ་ག་ལ་ཡོད། །
en: “ ‘But, little one, what could I eat here?

source: དེ་བཞིན་བཏུང་བ་དག་གི་རྣམ་པ་དང་། །གནས་པ་དག་ཀྱང་རབ་ཏུ་མེད་པས་ན། །བྲམ་ཟེ་གང་གིས་ཚལ་འདིའི་ནང་དུ་གཟུང་། །
en: There is nothing to drink, nor place to dwell, So how could a brahmin Make a home in this forest?’

source: དྲང་སྲོང་གིས་ནི་ཡོངས་སུ་དྲིས་པའི་ཟས། །མེད་དེ་དེ་བཞིན་བཏུང་དང་ཏིལ་མེད་ཅིང་། །འབྲས་ཀྱང་ཡོད་པ་མ་ཡིན་མལ་ཆ་དང་། །སྟན་དག་བདག་ལ་ཡོད་པ་མ་ཡིན་པས། །དྲང་སྲོང་ལ་ནི་བདག་ཉིད་གཏང་བྱ་སྟེ
en: “ ‘O sage, since you’ve asked: There is no food, nor anything to drink, Not even sesame seeds or rice. I do not have a mat or bedding. “ ‘So I’ll give myself to you, O sage—

source: དྲང་སྲོང་རབ་ཏུ་དགའ་བས་བདག་མནོབས་ལ། །
en: You can wear my skin with pleasure, O sage.

source: མཐོང་བའི་ཆོས་ལ་དགའ་བ་རྙེད་དགའ་ནས། །
en: You will then find pleasure in this visible world.

source: མནོབས་ཏེ་བདག་གི་ཚལ་འདིར་ཞུགས་པར་མཛོད། །
en: Wearing my skin, please stay here in my forest.’

source: དེ་ནི་སད་པར་བྱ་ཕྱིར་ཚིག་སྨྲས་པ། །
en: “The brahmin decided to test him, saying:

source: ཁྱོད་ནི་དེ་རིང་བཟའ་ཞིང་ཚལ་གནས་བྱ། །
en: “ ‘I will eat you today and make my home in the forest.

source: ཁྱོད་ཉིད་ཁྱོད་ཀྱིས་སོད་ལ་བདག་ལ་བྱིན། །
en: Please kill yourself and give your body to me—

source: ཁྱོད་ཟོས་བདག་ནི་ཡིད་དགའ་གནས་པར་བྱ། །
en: Once I’ve eaten you, I can stay here contentedly.’

source: ལུས་ལ་ལྟོས་པ་མེད་ཀྱིས་མེའི་ནང་དུ། །བདག་ནི་ཆུག་སྟེ་དི་རིང་མནབས་པར་མཛོད། །
en: “ ‘I will throw myself in the fire without hesitation; Today you will wear my skin.

source: ཤི་མ་ཐག་ཏུ་ཡིད་ནི་དགར་འགྱུར་ཞིང་། །མཁས་པ་དག་དང་ཡིད་དགའ་ཕྲད་པར་འགྱུར། །
en: Once I die you will be happy And the wise will rejoice.’

source: དྲང་སྲོང་གིས་ནི་དེ་ལ་སད་བྱའི་ཕྱིར། །དེར་ནི་རྩྭ་དང་ཤིང་དག་བསྡུས་ནས་སུ། །མེ་ནི་བུས་ནས་རི་བོང་ལ་སྨྲས་པ། །སྲེགས་ཤིག་བདག་གིས་ཚལ་དུ་གནས་པར་བྱ། །
en: “To continue to test him, The sage gathered grass and wood And started a fire, then told the rabbit, ‘Roast yourself so I can stay in the forest.’

source: མེ་འབར་དེ་ནི་རི་བོང་མཐོང་ནས་སུ། །རྫིང་གི་ཆུ་བསིལ་ནང་དུ་འཇུག་པ་ལྟར། །དད་པ་རྒྱ་ཆེར་བསྐྱེད་ནས་འབར་བ་རུ། །གང་ལའང་ལྟོས་པ་མེད་པར་དེར་ཞུགས་སོ། །
en: “The rabbit saw the fire; then, full of faith And without a second thought, It jumped into the flames As if diving into a pool of cool water.

source: རི་བོང་ལ་ནི་དྲང་སྲོང་དེ་ཡིས་སུ། །དགའ་བསྐྱེད་བྱམས་ཤིང་སྐྱོབས་པས་དེ་བཟུང་སྟེ། །
en: “The sage was pleased and lovingly Grabbed the rabbit and saved it.

source: ཅུང་རྩན་བསྐལ་པའི་བར་དུ་ཚལ་འདུག་ཤིག །ཁྱོད་ལ་ཕན་པར་བྱ་ཕྱིར་ཚལ་གནས་བྱ། །
en: ‘Little one, may you live in this forest an eon. I will stay in the forest to help you.’

source: དྲང་སྲོང་དེ་ནི་ཚལ་དེར་གནས་ནས་སུ། །རི་བོང་དེ་ལ་ཕན་པའི་གདམས་པ་ནི། །དགེ་བ་དཔག་ཏུ་མེད་པའི་ལས་བྱས་པས། །མཐོ་རིས་འགྲོ་ཞིང་དེར་ནི་བདེ་བ་འབྱུང་། །
en: “Remaining there in the forest, The sage gave the rabbit helpful advice, So that it did countless good deeds And found happiness in the higher realms.

source: དེའི་ཚེ་དེའི་དུས་ན་རི་བོང་དུ་གྱུར་པ་དེ་གཞན་ཡིན་པར་སེམས་ན། ཁྱོད་ཀྱིས་དེ་ལྟར་མི་བལྟ་སྟེ། །
en: Maudgalyāyana, in case you may think that at that time the rabbit was anyone else, do not think so.

source: ང་དེའི་ཚེ་དེའི་དུས་ན་རི་བོང་དུ་གྱུར་ཏོ། །
en: In those days the rabbit was me.
